# 13 Pandas
* Series
* Dataframe
* Import Data form excel, csv, sql
* Data type
* Data Inspection
* Data Processing Plan
* Dataframe to Numpy array

* [House Sales Dataset](https://www.kaggle.com/harlfoxem/housesalesprediction)
* [Human Resources Dataset](https://www.kaggle.com/rhuebner/human-resources-data-set)

# Installation
```bash
conda install pandas
```

In [5]:
import pandas as pd
import numpy as np

# Series

In [13]:
# create a series from a list, please note the datatype (dtype)
s = pd.Series([1, 3, 5])
s

0    1
1    3
2    5
dtype: int64

In [14]:
# checking datatype of the series
type(s)

pandas.core.series.Series

In [27]:
# casting the datatyoe of the series to 'int32'
s = pd.Series([1, 3, 5], dtype='int32')
s

0    1
1    3
2    5
dtype: int32

In [28]:
# another way for casting the datatyoe of the series
s.astype('float32')

0    1.0
1    3.0
2    5.0
dtype: float32

In [15]:
# the number 3.1 is initialized to be float64
s = pd.Series([1, 3, 5, 3.1])
s

0    1.0
1    3.0
2    5.0
3    3.1
dtype: float64

In [16]:
# the number 'hello' is initialized to be object
s = pd.Series([1, 3, 5, 3.1,'hello'])
s

0        1
1        3
2        5
3      3.1
4    hello
dtype: object

In [17]:
s.index

RangeIndex(start=0, stop=5, step=1)

# Dataframe

In [84]:
d={
    'A': 1.,
    'B':[1, 3, 5, 3.1,'hello'],
}
df = pd.DataFrame(d)
print(df)

     A      B
0  1.0      1
1  1.0      3
2  1.0      5
3  1.0    3.1
4  1.0  hello

In [85]:
df

     A      B
0  1.0      1
1  1.0      3
2  1.0      5
3  1.0    3.1
4  1.0  hello

# Access Column

In [86]:
# column as a data member
df.B

0        1
1        3
2        5
3      3.1
4    hello
Name: B, dtype: object

In [87]:
# column as a key
df['B']

0        1
1        3
2        5
3      3.1
4    hello
Name: B, dtype: object

In [92]:
# data frame as a matrix
df.iloc[:,1]

0        1
1        3
2        5
3      3.1
4    hello
Name: B, dtype: object

# Access Row

In [98]:
# access the first row by integer of location
df.iloc[0,:]

A    1
B    1
Name: 0, dtype: object

In [99]:
# access the first row by label
df.loc[0]

A    1
B    1
Name: 0, dtype: object

# Data type

In [35]:
%%html
<style>
table {float:left}
</style>

| Pandas dtype | Usage |
|:---|:---|
| object | Text or mixed numeric and non-numeric values |
| int64 | Integer numbers |
| float64 | Floating point numbers |
| bool | True/False values |
| datetime64 | Date and time values |
| timedelta[ns] | Differences between two datetimes |
| category | Finite list of text values |

# df.info()

In [108]:
d={
    'A': [4, None, 6],
    'B':['2020-11-1','2020-11-21','2020-11-30'],
    'C':['hello','21/11/2020','30/11/2020'],
}
df = pd.DataFrame(d)
df

     A           B           C
0  4.0   2020-11-1       hello
1  NaN  2020-11-21  21/11/2020
2  6.0  2020-11-30  30/11/2020

In [109]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       2 non-null      float64
 1   B       3 non-null      object
 2   C       3 non-null      object
dtypes: float64(1), object(2)
memory usage: 200.0+ bytes

# string-to-datetime conversion

In [110]:
pd.to_datetime(df.B, format='%Y-%m-%d')

0   2020-11-01
1   2020-11-21
2   2020-11-30
Name: B, dtype: datetime64[ns]

In [111]:
pd.to_datetime(df.C, format='%d/%m/%Y', errors='coerce')

0          NaT
1   2020-11-21
2   2020-11-30
Name: C, dtype: datetime64[ns]

In [112]:
df2=df
df2.B=pd.to_datetime(df.B, format='%Y-%m-%d')
df2.C=pd.to_datetime(df.C, format='%d/%m/%Y', errors='coerce')
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       2 non-null      float64
 1   B       3 non-null      datetime64[ns]
 2   C       2 non-null      datetime64[ns]
dtypes: datetime64[ns](2), float64(1)
memory usage: 200.0 bytes

# Import Data form excel, csv, sql

In [43]:
df = pd.read_csv('kc_house_data.csv',infer_datetime_format=True)

# Head and Tail

In [40]:
df.head()

,id,date,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors,waterfront,view,...,grade,sqft_above,sqft_basement,yr_built,yr_renovated,zipcode,lat,long,sqft_living15,sqft_lot15
0,7129300520,20141013T000000,221900.0,3,1.00,1180,5650,1.0,0,0,...,7,1180,0,1955,0,98178,47.5112,-122.257,1340,5650
1,6414100192,20141209T000000,538000.0,3,2.25,2570,7242,2.0,0,0,...,7,2170,400,1951,1991,98125,47.7210,-122.319,1690,7639
2,5631500400,20150225T000000,180000.0,2,1.00,770,10000,1.0,0,0,...,6,770,0,1933,0,98028,47.7379,-122.233,2720,8062
3,2487200875,20141209T000000,604000.0,4,3.00,1960,5000,1.0,0,0,...,7,1050,910,1965,0,98136,47.5208,-122.393,1360,5000
4,1954400510,20150218T000000,510000.0,3,2.00,1680,8080,1.0,0,0,...,8,1680,0,1987,0,98074,47.6168,-122.045,1800,7503

In [41]:
df.tail()

,id,date,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors,waterfront,view,...,grade,sqft_above,sqft_basement,yr_built,yr_renovated,zipcode,lat,long,sqft_living15,sqft_lot15
21608,263000018,20140521T000000,360000.0,3,2.50,1530,1131,3.0,0,0,...,8,1530,0,2009,0,98103,47.6993,-122.346,1530,1509
21609,6600060120,20150223T000000,400000.0,4,2.50,2310,5813,2.0,0,0,...,8,2310,0,2014,0,98146,47.5107,-122.362,1830,7200
21610,1523300141,20140623T000000,402101.0,2,0.75,1020,1350,2.0,0,0,...,7,1020,0,2009,0,98144,47.5944,-122.299,1020,2007
21611,291310100,20150116T000000,400000.0,3,2.50,1600,2388,2.0,0,0,...,8,1600,0,2004,0,98027,47.5345,-122.069,1410,1287
21612,1523300157,20141015T000000,325000.0,2,0.75,1020,1076,2.0,0,0,...,7,1020,0,2008,0,98144,47.5941,-122.299,1020,1357

# Data Inspection

In [45]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 21613 entries, 0 to 21612
Data columns (total 21 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   id             21613 non-null  int64
 1   date           21613 non-null  object
 2   price          21613 non-null  float64
 3   bedrooms       21613 non-null  int64
 4   bathrooms      21613 non-null  float64
 5   sqft_living    21613 non-null  int64
 6   sqft_lot       21613 non-null  int64
 7   floors         21613 non-null  float64
 8   waterfront     21613 non-null  int64
 9   view           21613 non-null  int64
 10  condition      21613 non-null  int64
 11  grade          21613 non-null  int64
 12  sqft_above     21613 non-null  int64
 13  sqft_basement  21613 non-null  int64
 14  yr_built       21613 non-null  int64
 15  yr_renovated   21613 non-null  int64
 16  zipcode        21613 non-null  int64
 17  lat            21613 non-null  float64
 18  long           21613 non-null  float64
 19  sqft_living15  21613 non-null  int64
 20  sqft_lot15     21613 non-null  int64
dtypes: float64(5), int64(15), object(1)
memory usage: 3.5+ MB

# converting series to datatime

In [ ]:
df.date.astype()

# Data Processing Plan

# Droping Data

# Dataframe to Numpy array